app/controllers/smoothies_controller.rb

SELECT "smoothies".* FROM "smoothies"
---
  def index
    @smoothies = Smoothie.all

SELECT "smoothies".* FROM "smoothies" WHERE "smoothies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    smoothie = Smoothie.find_by_id(params[:id])

SELECT "smoothies".* FROM "smoothies" WHERE "smoothies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_smoothy
      @smoothy = Smoothie.find(params[:id])